---
kind: method
id: M:Autodesk.Revit.DB.FabricationHostedInfo.GetBearerCenterline
source: html/9fd81153-3d66-f18f-eb43-41bc84284b13.htm
---
# Autodesk.Revit.DB.FabricationHostedInfo.GetBearerCenterline Method

Gets the centerline of the bearer. The method is applicable only for bearer hanger.

## Syntax (C#)
```csharp
public Line GetBearerCenterline()
```

## Returns
The centerline of the bearer.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The hanger is not a bearer hanger.